<?xml version="1.0" encoding="UTF-8"?>
<!-- ********************************************************************
     $Id: nfs5.xml,v 1.1 2002/09/30 18:07:50 nilgun Exp $
     ******************************************************************** -->

<sect1 id="archive-man-5-nfs">
  <sect1info>
    <title>nfs(5)</title>
  </sect1info>
<div>
<h2>İSİM</h2>
<p/>
nfs - nfs fstab bi&#231;em ve se&#231;enekleri

<h2>ILGILI DOSYALAR</h2>
<p/>
<b>/etc/fstab</b>


<h2>TANIM</h2>
<p/>
<em>fstab</em>

dosyasi  hangi dosya sisteminin nereye ve hangi se&#231;eneklerle baglanacagini
belirtir. NFS baglantilari i&#231;in, sunucu adi ve ithal edilen sunucu dizini,
baglanti kurulacak yerel dizin ve dosya sisteminin nasil baglanacagini
kontrol eden NFS e &#246;zel se&#231;enekler i&#231;erir.

Asagida <em>/etc/fstab</em> dosyasindan NFS baglantisi i&#231;in kullanilan
bir &#246;rnek bulunmaktadir.
<p/>

<h3>Se&#231;enekler</h3>

<dl>
<dt><em>rsize=n</em></dt><dd>
NFS sunucusundan dosyalarin okunmasi sirasinda NFS in kullandigi bayt
sayisi. &#214;ntanimli deger &#231;ekirdege bagimlidir, su an 1024 bayttir.
<p/></dd>
<dt><em>wsize=n</em></dt><dd>
NFS sunucusundan dosyalarin yazilmasi sirasinda NFS in kullandigi bayt
sayisi. &#214;ntanimli deger &#231;ekirdege bagimlidir, su an 1024 bayttir.
<p/></dd>
<dt><em>timeo=n</em></dt><dd>
Saniyenin onda biri cinsinden bir RPC zamanasimindan sonra ilk
yeniden aktarimin yapilmasinin degeri. &#214;ntanimli deger 0.7 saniyedir. Ilk
zaman asimindan sonra, zamanasim s&#252;resi her artarta zamanasiminda ikiye
katlanarak 60 saniyeye ulasana dek yada b&#252;y&#252;k bir zamanasimina sebep
olacak yeterli yeniden aktarim olana dek devam eder. Bundan sonra, eger
dosya sistemi sabit baglanmissa, her yeni zamanasimi basamaginda ,
yeniden aktarimi ikiye katlamak &#252;zere, &#246;nceki zamanasimi basamaginin ilk
degerinin iki kati olarak yeniden baslar. En b&#252;y&#252;k zamanasimi her zaman 60
saniyedir.
Mesgul bir aga, yavas bir sunucuya yada birden fazla y&#246;nlendirici yada
agge&#231;idi &#252;zerinden baglanirken zamanasimi degerini artirarak, daha iyi
genel performans saglanabilir.<p/></dd>
<dt><em>retrans=n</em></dt><dd>
B&#252;y&#252;k bir zamanasiminin olusmasi i&#231;in gereken k&#252;&#231;&#252;k zamanasimlarinin ve
yeniden aktarimlarin adedi. &#214;ntanimli degeri 3 zamanasimidir. B&#252;y&#252;k bir
zamanasimi olustugunda, dosya islemi ya iptal edilir yada &quot;server
not responding&quot; (sunucu yanit vermiyor) iletisi konsola basilir.
<p/></dd>
<dt><em>acregmin=n</em></dt><dd>
&#214;ntanimli degeri 3 t&#252;r.<p/></dd>
<dt><em>acregmax=n</em></dt><dd>
Bir sunucudan taze bilgi istemeden &#246;nce d&#252;zg&#252;n bir dosyanin &#246;zelliklerinin
&#246;nbelleklenmesi i&#231;in ge&#231;en en uzun zamanin saniye cinsinden degeri.
&#214;ntanimli degeri 60 saniyedir.<p/></dd>
<dt><em>acdirmin=n</em></dt><dd>
Bir sunucudan taze bilgi istemeden &#246;nce  bir dizinin &#246;zelliklerinin
&#246;nbelleklenmesi i&#231;in ge&#231;en en kisa zamanin saniye cinsinden degeri.
&#214;ntanimli degeri 30 saniyedir.<p/></dd>
<dt><em>acdirmax=n</em></dt><dd>
Bir sunucudan taze bilgi istemeden &#246;nce  bir dizinin &#246;zelliklerinin
&#246;nbelleklenmesi i&#231;in ge&#231;en en uzun zamanin saniye cinsinden degeri.
&#214;ntanimli degeri 60 saniyedir.<p/></dd>
<dt><em>actimeo=n</em></dt><dd>
actimeo kullanilarak <em>acregmin,</em> <em>acregmax,</em> <em>acdirmin,</em>
ve <em>acdirmax</em> ayni degere esitlenir. &#214;ntanimli bir deger yoktur.
<p/></dd>
<dt><em>retry=n</em></dt><dd>
Arka plandaki NFS baglanti isleminin ka&#231; kere yeniden denenecegini
belirtir. &#214;ntanimli degeri 10000 keredir.<p/></dd>
<dt><em>namlen=n</em></dt><dd>
NFS sunucusu  RPC baglanti protokol&#252;n&#252;n ikinci s&#252;r&#252;m&#252;n&#252; desteklemezse, bu
se&#231;enek uzaktaki dosya sisteminde desteklenen en uzun dosya ismini
belirtmek i&#231;in kullanilir. Bu POSIX pathconf fonksiyonlarinin
desteklenmesi i&#231;in kullanilir. &#214;ntanimli degeri 255 karakterdir.
<p/></dd>
<dt><em>port=n</em></dt><dd>
NFS sunucusuna baglanmak i&#231;in kullanilan port numarasi. Eger port numarasi
0 sa (&#214;ntanimli deger), uzaktaki makinanin port atayicisina kullanilacak
port numarasi i&#231;in sorgu g&#246;nderir. Eger uzaktaki makinanin NFS daemonu
port atayicisina kayitli degilse, bunun yerine standart NFS port numarasi
2049 olarak kullanilir.<p/></dd>
<dt><em>mountport=n</em></dt><dd>
<b>mountd</b> portununu sayisal degeri.<p/></dd>
<dt><em>mounthost=name</em></dt><dd>
<b>mountd </b> calisan makina adi.<p/></dd>
<dt><em>mountprog=n</em></dt><dd>
Uzak makinadaki baglanti daemon ununa baglanirken degisik bir RPC program
numarasi  kullanir. Bu se&#231;enek birden fazla NFS hizmeti veren makinalar
i&#231;in faydalidir.&#214;ntanimli degeri standart baglanti daemon program numarasi
olan 100005 dir.<p/></dd>
<dt><em>mountvers=n</em></dt><dd>
Uzak makinadaki baglanti daemon ununa baglanirken degisik bir RPC s&#252;r&#252;m
numarasi  kullanir. Bu se&#231;enek birden fazla NFS hizmeti veren makinalar
i&#231;in faydalidir.&#214;ntanimli degeri s&#252;r&#252;m 1 dir.
<p/></dd>
<dt><em>nfsprog=n</em></dt><dd>
Uzak makinadaki NFS daemon ununa baglanirken degisik bir RPC program
numarasi  kullanir. Bu se&#231;enek birden fazla NFS hizmeti veren makinalar
i&#231;in faydalidir.&#214;ntanimli degeri standard RPC NFS daemon program numarasi
olan 100003 t&#252;r.<p/></dd>
<dt><em>nfsvers=n</em></dt><dd>
Uzak makinadaki NFS daemon ununa baglanirken degisik bir RPC s&#252;r&#252;m
numarasi kullanir. Bu se&#231;enek birden fazla NFS hizmeti veren makinalar
i&#231;in faydalidir.&#214;ntanimli degeri s&#252;r&#252;m ikidir.
<p/></dd>
<dt><em>bg</em></dt><dd>
Eger ilk NFS baglanti denemesi zamanasimina ugrarsa, arka planda denemeye
devam eder. &#214;ntanimli degeri arka planda baglamaya &#231;alismak yerine sona
ermektir.<p/></dd>
<dt><em>fg</em></dt><dd>
Eger ilk NFS baglanti denemesi zamanasimina ugrarsa, derhal sona erer. Bu
&#214;ntanimli degerdir.<p/></dd>
<dt><em>soft</em></dt><dd>
Eger bir NFS dosya islemi b&#252;y&#252;k bir zamanasimina ugradiysa cagiran
programa I/O (girdi/&#231;ikti) hatasi rapor eder. &#214;ntanimli degeri NFS dosya
islemlerine s&#252;rekli devam etmektir.<p/></dd>
<dt><em>hard</em></dt><dd>
Eger bir NFS dosya islemi b&#252;y&#252;k bir zamanasimina ugradiysa konsola &quot;server
not reponding&quot; (sunucu cevap vermiyor) iletisinin basilmasini ve s&#252;rekli
yeniden denemesini saglar. Bu &#246;ntanimli degerdir.<p/></dd>
<dt><em>intr</em></dt><dd>
Eger bir NFS dosya islemi b&#252;y&#252;k bir zamanasimina ugradiysa ve sabit
bagliysa, sinyallerin dosya islemini kesmesini ve EINTR degeriyle
&#231;agrildigi programa d&#246;nmesini saglar. &#214;ntanimli degeri dosya islemlerinin
kesmeye ugramamasidir.<p/></dd>
<dt><em>posix</em></dt><dd>
NFS dosya sistemini POSIX anlamkurallariyla baglar. Bu NFS dosya
sisteminin, en uzun dosya ismi i&#231;in  baglanti sunucusunun sorgulanmasi
suretiyle, POSIX pathconf komutunu uygun bir sekilde desteklemesini
saglar. Bunu yapmak i&#231;in, uzaktaki makinanin RPC baglanti protokol&#252;n&#252;n
ikinci s&#252;r&#252;m&#252;n&#252; desteklemesi gerekir. Bir&#231;ok NFS sunucusu sadece birinci
s&#252;r&#252;m&#252; destekler.<p/></dd>
<dt><em>nocto</em></dt><dd>
Dosya yaratilmasi sirasinda yeni &#246;zelliklerin alinmasini &#246;nler.
<p/></dd>
<dt><em>noac</em></dt><dd>
&#214;zellik &#246;nbelleklemenin t&#252;m &#231;esitlerini engeller. Bu sunucunun
performansini k&#246;t&#252; y&#246;nden etkiler, ancak farkli iki NFS istemcisinin
sunucu &#252;zerinde ortak bir dosya sistemine yazarken kaydadeger iyi sonu&#231;lar
alinmasini saglar.<p/></dd>
<dt><em>tcp</em></dt><dd>
NFS dosya sistemini &#246;ntanimli olan UDP protokol&#252;n&#252;n yerine TCP protokol&#252;n&#252;
kullanarak baglar. Bir&#231;ok NFS sunucusu sadece UDP yi destekler.
<p/></dd>
<dt><em>udp</em></dt><dd>
NFS dosya sistemini UDP protokol&#252;n&#252; kullanarak baglar. &#214;ntanimli deger
budur.
B&#252;t&#252;n deger gerektirmeyen se&#231;eneklere karsilik gelen se&#231;eneksiz bi&#231;emler
bulunur. &#214;rnegin, nointr dosya islemlerinin kesmeye ugramamasi anlamina
gelir.<p/></dd>
</dl>

<h2>DOSYALAR</h2>
<p/>
<em>/etc/fstab</em>


<h2>ILGILI KOMUTLAR</h2>
<p/>
<b>fstab</b>(5), <b>mount</b>(8),
<b>umount</b>(8), <b>exports</b>(5)


<h2>YAZAR</h2>
<p/>
&quot;Rick Sladkey&quot; &lt;<a href="mailto:jrs@world.std.com">jrs@world.std.com</a>&gt;

<h2>HATALAR</h2>
<p/>
bg, fg, retry , posix ve nocto se&#231;enekleri mount tarafindan ayristirilir
ancak sessizce ihmal edilir.

tcp ve namlen se&#231;enekleri kodlanmistir ama Linux &#231;ekirdegi tarafindan
desteklenmemektedir.

umount komutu NFS dosya sistemi ayrilinca sunucuyu haberdar etmelidir.

<p/>

</div></sect1>